of40/tutorials/rheoInterFoam/ImpactingDrop/Oldroyd-BLog/0/theta.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{

    atmosphere
    {
       type            fixedValue;
       value           uniform (0 0 0 0 0 0);
    }
    plate
    {
       type            zeroGradient;
    }
     wFront
    {
	type            wedge;     
    }
    wBack
    {
	type            wedge;     
    }
    axis
    {
	type            empty;     
    }
   
}

// ************************************************************************* //
